# vim: ft=ruby

tap "homebrew/core"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/services"
tap "heroku/brew"

brew "ansible"
brew "autojump"
brew "chruby"
brew "clojure"
brew "ctags"
brew "docker-compose"
brew "doctl"
brew "fd"
brew "fzf"
brew "gcc"
brew "git"
brew "git-lfs"
brew "gnupg"
brew "hadolint"
brew "heroku/brew/heroku"
brew "htop"
brew "hub"
brew "imagemagick"
brew "jrnl"
brew "kubernetes-cli"
brew "libzip"
brew "llvm"
brew "macvim", link: false
brew "mas"
brew "mosh"
brew "ncdu"
brew "neovim", args: ["HEAD"], link: false
brew "node"
brew "openssh"
brew "openssl"
brew "postgresql"
brew "python"
brew "readline"
brew "reattach-to-user-namespace"
brew "redis"
brew "ruby-install"
brew "shellcheck"
brew "terminal-notifier"
brew "terraform"
brew "the_silver_searcher"
brew "thoughtbot/formulae/rcm"
brew "tig"
brew "tldr"
brew "tmux"
brew "tree"
brew "unrar"
brew "vim"
brew "vips"
brew "watch"
brew "wget"
brew "youtube-dl"
brew "zsh"
brew "zsh-autosuggestions"

cask "alfred"
cask "appcleaner"
cask "caprine"
cask "dash"
cask "docker"
cask "firefox-developer-edition"
cask "google-chrome"
cask "imageoptim"
cask "karabiner-elements"
cask "licecap"
cask "little-snitch"
cask "qlcolorcode"
cask "qlmarkdown"
cask "qlstephen"
cask "quicklook-csv"
cask "quicklook-json"
cask "spotify"
cask "sqlectron"
cask "sqlitebrowser"
cask "vlc"

mas "1Password 7", id: 1333542190
mas "Better", id: 1121192229
mas "Instapaper", id: 1481302432
mas "Keynote", id: 409183694
mas "Lungo", id: 1263070803
mas "Noizio", id: 928871589
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pixelmator", id: 407963104
mas "Sip", id: 507257563
mas "Telegram", id: 747648890
mas "The Unarchiver", id: 425424353
mas "Things", id: 904280696
mas "Tweetbot", id: 1384080005
mas "Xcode", id: 497799835
mas "iA Writer", id: 775737590
