# vim: ft=ruby

tap "homebrew/core"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/services"
tap "heroku/brew"

brew "asdf"
brew "awscli"
brew "clojure"
brew "ctags"
brew "doctl"
brew "fd"
brew "fzf"
brew "gcc"
brew "gh"
brew "git"
brew "git-lfs"
brew "gnupg"
brew "hadolint"
brew "heroku/brew/heroku"
brew "htop"
brew "hub"
brew "imagemagick"
brew "jq"
brew "jrnl"
brew "libzip"
brew "mas"
brew "mosh"
brew "ncdu"
brew "node"
brew "openssh"
brew "openssl"
brew "postgresql"
brew "python"
brew "rcm"
brew "readline"
brew "reattach-to-user-namespace"
brew "redis"
brew "shellcheck"
brew "switchaudio-osx"
brew "terminal-notifier"
brew "the_silver_searcher"
brew "tig"
brew "tldr"
brew "tmux"
brew "tree"
brew "unrar"
brew "vim"
brew "vips"
brew "watch"
brew "wget"
brew "yarn"
brew "youtube-dl"
brew "zsh"
brew "zsh-autosuggestions"

cask "alfred"
cask "appcleaner"
cask "bitbar"
cask "discord"
cask "docker"
cask "firefox-developer-edition"
cask "hammerspoon"
cask "imageoptim"
cask "karabiner-elements"
cask "little-snitch"
cask "postico"
cask "signal"
cask "spectacle"
cask "spotify"
cask "transmit"

mas "Instapaper Save", id: 1481302432
mas "Keynote", id: 409183694
mas "Lungo", id: 1263070803
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pixelmator Pro", id: 1289583905
mas "Telegram", id: 747648890
mas "The Unarchiver", id: 425424353
mas "Things", id: 904280696
mas "Tweetbot", id: 1384080005
mas "Xcode", id: 497799835
mas "iA Writer", id: 775737590
