# vim: ft=ruby

brew "asdf"
brew "ctags"
brew "doctl"
brew "fd"
brew "fzf"
brew "gawk"
brew "gcc"
brew "gh"
brew "git"
brew "gnupg"
brew "hadolint"
brew "htop"
brew "imagemagick"
brew "jq"
brew "libzip"
brew "mas"
brew "mosh"
brew "ncdu"
brew "nvim"
brew "openssh"
brew "openssl"
brew "postgresql@14"
brew "python"
brew "readline"
brew "reattach-to-user-namespace"
brew "redis"
brew "shellcheck"
brew "switchaudio-osx"
brew "the_silver_searcher"
brew "tig"
brew "tldr"
brew "tmux"
brew "tree"
brew "vim"
brew "vips"
brew "watch"
brew "wget"
brew "youtube-dl"
brew "zsh"
brew "zsh-autosuggestions"

cask "appcleaner"
cask "docker"
cask "raycast"
cask "signal"
cask "swiftbar"
cask "transmit"

mas "Lungo", id: 1263070803
mas "Pixelmator Pro", id: 1289583905
mas "Telegram", id: 747648890
mas "Things", id: 904280696
mas "iA Writer", id: 775737590
