{
  "ag.vim": { "branch": "master" },
  "ale": { "branch": "master" },
  "copilot.vim": { "branch": "release" },
  "fzf": { "branch": "master" },
  "fzf.vim": { "branch": "master" },
  "gruvbox-material": { "branch": "master" },
  "iceberg.vim": { "branch": "master" },
  "lazy.nvim": { "branch": "main" },
  "lazyList.vim": { "branch": "master" },
  "lualine.nvim": { "branch": "master" },
  "nerdtree": { "branch": "master" },
  "nord-vim": { "branch": "main" },
  "nvim-hidesig": { "branch": "master" },
  "nvim-treesitter": { "branch": "master" },
  "nvim-treesitter-context": { "branch": "master" },
  "nvim-treesitter-textobjects": { "branch": "master" },
  "oil.nvim": { "branch": "master" },
  "splitjoin.vim": { "branch": "main" },
  "switch.vim": { "branch": "main" },
  "tabular": { "branch": "master" },
  "tender.vim": { "branch": "master" },
  "tokyonight.nvim": { "branch": "main" },
  "undotree": { "branch": "master" },
  "vim-applescript": { "branch": "master" },
  "vim-colors-github": { "branch": "master" },
  "vim-colors-pencil": { "branch": "master" },
  "vim-commentary": { "branch": "master" },
  "vim-ctrlspace": { "branch": "master" },
  "vim-dirdiff": { "branch": "master" },
  "vim-endwise": { "branch": "master" },
  "vim-fugitive": { "branch": "master" },
  "vim-gitgutter": { "branch": "main" },
  "vim-graphql": { "branch": "master" },
  "vim-indexed-search": { "branch": "master" },
  "vim-jdaddy": { "branch": "master" },
  "vim-log-highlighting": { "branch": "master" },
  "vim-markdown": { "branch": "master" },
  "vim-matchup": { "branch": "master" },
  "vim-obsession": { "branch": "master" },
  "vim-one": { "branch": "master" },
  "vim-projectionist": { "branch": "master" },
  "vim-rails": { "branch": "master" },
  "vim-rake": { "branch": "master" },
  "vim-repeat": { "branch": "master" },
  "vim-rhubarb": { "branch": "master" },
  "vim-surround": { "branch": "master" },
  "vim-unimpaired": { "branch": "master" },
  "vimux": { "branch": "master" }
}
